---
kind: property
id: P:Autodesk.Revit.DB.SpacingRule.GridlinesRotation
source: html/dd4ee219-0266-80c3-a5ad-650393655b41.htm
---
# Autodesk.Revit.DB.SpacingRule.GridlinesRotation Property

An additional rotation to be applied
to this set of grid lines.

## Syntax (C#)
```csharp
public double GridlinesRotation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when
angle is outside of the range ( -PI/2, PI/2 ).